batisteo.vscode-django
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
isudox.vscode-jetbrains-keybindings
kevinrose.vsc-python-indent
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
njpwerner.autodocstring
nvarner.typst-lsp
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-german
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
wholroyd.jinja
